sicp_notes.org
#+TITLE: SICP Notes
#+AUTHOR: Sooheon Kim
#+DATE: Summer 2015

* Building Abstractions with Procedures
Definition of square root:
\sqrt(x) = \mbox{the } y \mbox{ such that } y >= 0 \mbox{ and } y^2 = x

This definition is a valid mathematical function which describes the relationship between a number and its root. It is /not/ a valid process by which a square root may be derived. A function is declarative knowledge (the properties of a thing), and a procedure is /imperative/ knowledge (how to do a thing).

** Heron of Alexandria's Square Root Algorithm
To find sqrt(x) approximately:
1. Make a guess G
2. Improve guess by averaging G and X
3. Keep improving G until it is good enough
4. Use 1 as an initial guess

|  Guess | Quotient          | Avg.                         |
|--------+-------------------+------------------------------|
|      1 | 2/1 = 2           | ((2+1)/2) = 1.5              |
|    1.5 | 2/1.5 = 1.3333    | ((1.3333+1.5)/2) = 1.4167    |
| 1.4167 | 2/1.4167 = 1.4118 | ((1.4167+1.4118)/2) = 1.4142 |
| 1.4142 | ...               | ...                          |

*** Naive Version
#+BEGIN_SRC clojure
  (defn abs [n]
    (if (< n 0)
      (- n)
      n))

  (defn square [n]
    (* n n))

  (defn average [x y]
    (/ (+ x y) 2))

  (defn improve [guess x]
    (average guess (/ x guess)))

  (defn good-enough? [guess x]
    (< (abs (- (square guess) x)) 0.001))

  (defn sqrt-iter [guess x]
    (if (good-enough? guess x)
      guess
      (sqrt-iter (improve guess x) x)))

  (defn sqrt [x]
    (sqrt-iter 1 x))

  (sqrt 2.0)
  ;; => 1.4142156862745097
#+END_SRC

#+RESULTS:
: #'user/abs#'user/square#'user/average#'user/improve#'user/good-enough?#'user/sqrt-iter#'user/sqrt1.4142156862745097

*** Blocked Version
Keeping helper functions =good-enough?= and others from polluting namespace. This idea originated with Algol 60.

#+BEGIN_SRC clojure
  (defn sqrt2 [x]
    (defn good-enough? [guess x]
      (< (abs (- (square guess) x)) 0.001))
    (defn improve [guess x]
      (/ (+ guess (/ x guess)) 2))
    (defn sqrt-iter [guess x]
      (if (good-enough? guess x)
        guess
        (sqrt-iter (improve guess x) x)))
    (sqrt-iter 1.0 x))

  (sqrt2 2)
  ;; => 1.4142156862745097
#+END_SRC

#+RESULTS:
: #'user/sqrt21.4142156862745097

*** Exercise 1.6
Define =if= in terms of =cond=:

#+BEGIN_SRC clojure
  (defn new-if [predicate then-clause else-clause]
    (cond
      predicate then-clause
      :else else-clause))

  (new-if (= 2 3) 0 5)
  ;; => 5
#+END_SRC

#+RESULTS:
: #'user/new-if5

Use =new-if= to write =square-root=:
#+BEGIN_SRC clojure
  (defn new-sqrt-iter [guess x]
    (new-if (good-enough? guess x)
            guess
            (new-sqrt-iter (improve guess x)
                           x)))
#+END_SRC

#+RESULTS:
: #'user/new-sqrt-iter

What happens when we eval this?
#+BEGIN_SRC clojure
  (new-sqrt-iter 1 2)

  (new-if (good-enough? 1 2)
          1
          (new-sqrt-iter (improve 1 2) 2))

  (new-if false
          1
          (new-sqrt-iter (improve 1 2) 2))

  (new-sqrt-iter (improve 1 2) 2)
#+END_SRC

...and so on, ad infinitum. This will result in infinite recursion, due to applicative-order evaluation. Because both the =then-clause= and =else-clause= operands are evaluated before being applied to the =cond= operator. Even when the predicate is true, the =else-clause= is evaluated, keeping the procedure from ever resolving.

*** Exercise 1.7
=good-enough?= will be inaccurate for very small numbers. It is also inadequate for very large numbers. Why?

#+BEGIN_SRC clojure
  (sqrt 0.0001)
  ;; => 0.03230844833048122
  ;; Should be 0.01
#+END_SRC

#+RESULTS:
: 0.0323084483304812210.000000000139897

#+BEGIN_SRC clojure
  (defn really-good-enough? [guess oldguess]
    "Stop if change after iteration is less than 0.01%"
    (<= (abs (- guess oldguess))
        (abs (* guess 0.0001))))

  (defn sqrt3-iter [guess oldguess x]
    (if (really-good-enough? guess oldguess)
      guess
      (sqrt3-iter (improve guess x) guess x)))

  (defn sqrt3 [x]
    (sqrt3-iter 1.0 2 x))

  (sqrt3 0.0001)
  ;; => 0.010000000025490743
#+END_SRC

#+RESULTS:
: #'user/really-good-enough?#'user/sqrt3-iter#'user/sqrt30.010000000025490743

*** Exercise 1.8
Newton's method for cube roots is based on the fact that if y is an approximation to the cube root of x, then a better approximation is given by the value:

$\frac{x/y^2 + 2y}{3}$

#+BEGIN_SRC clojure
  (defn cbrt-good-enough? [guess oldguess]
    "Stop if change after iteration is less than 0.01%"
    (<= (abs (- guess oldguess))
        (abs (* guess 0.0001))))

  (defn cbrt-improve [guess x]
    (/ (+ (/ x (* guess guess)) guess guess)
       3))

  (defn cbrt-iter [guess oldguess x]
    (if (cbrt-good-enough? guess oldguess)
      guess
      (cbrt-iter (cbrt-improve guess x) guess x)))

  (defn cbrt [x]
    (cbrt-iter 1.0 0 x))

  (cbrt 42)
  ;; => 3.476026657071078
#+END_SRC

** Procedures as Black-Box Abstractions
Defining procedures is a way to suppress detail. By forming black boxes around procedures which behave in expected ways, we no longer have to consider the details of the inner mechanism.

Parameters passed to black-box procedures are local to that procedure.

*** Lexical Scoping
We can have a [[*Naive%20Version][naive sqrt procedure]], leaves all its helper processes lying about. A smarter [[*Blocked%20Version][blocked version]] will put the helper procedures within the top level sqrt procedure. However, because they all share a lexical scope, and the variable x is unchanging within this scope, it is unnecessary to explicitly pass x to each procedure.

#+BEGIN_SRC clojure
  (defn lexical-sqrt [x]
    (defn good-enough? [guess]
            (< (abs (- (square guess) x)) 0.001))
    (defn improve [guess]
      (/ (+ guess (/ x guess)) 2))
    (defn iter [guess]
      (if (good-enough? guess)
        guess
        (iter (improve guess))))
    (iter 1.0))

  (lexical-sqrt 2)
  ;; => 1.4142156862745097
#+END_SRC

* Procedures and the Processes They Generate
** Substitution Rule
To evaluate an application:

1. Evaluate the operator to get procedure
2. Evaluate the operands to get arguments
3. Apply the procedure to the arguments
   1. Copy the body of the procedure, substituting the arguments supplied for the formal parameters of the procedure
   2. Evaluate the resulting new body

** Linear Recursion and Iteration
#+BEGIN_SRC clojure
  (defn recursive-factorial [n]
    (if (= n 1)
      1
      (* n (recursive-factorial (dec n)))))

  (factorial 5)
  (* 5 (factorial 4))
  (* 5 (* 4 (factorial 3)))
  (* 5 (* 4 (3 (factorial 2))))
  (* 5 (* 4 (* 3 (* 2 (factorial 1)))))
  (* 5 (* 4 (* 3 (* 2 (* 1 1)))))
  (* 5 (* 4 (* 3 (* 2 1))))
  (* 5 (* 4 (* 3 2)))
  (* 5 (* 4 6))
  (* 5 24)
  ;; => 120

  (defn fact-iter [product count max-count]
    (if (> count max-count)
      product
      (fact-iter (* count product)
                 (inc count)
                 max-count)))

  (defn iterative-factorial [n]
    (fact-iter 1 1 n))

  (iterative-factorial 5)
  (fact-iter 1 1 5)
  (fact-iter 1 2 5)
  (fact-iter 2 3 5)
  (fact-iter 6 4 5)
  (fact-iter 24 5 5)
  (fact-iter 120 6 5)
  ;; => 120
#+END_SRC

An iteration has all of its state in explicit variables. If the program is killed and restarted, it can continue. Recursion keeps some information "under the table", outside of explicit variables given to the program. 

#+BEGIN_SRC clojure
  (defn fib [n]
    (if (< n 2)
      n
      (+ (fib (- n 1))
         (fib (- n 2)))))
#+END_SRC

