sicp_notes.tex
% Created 2015-08-08 Sat 19:53
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Sooheon Kim}
\date{Summer 2015}
\title{SICP Notes}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.50.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Building Abstractions with Procedures}
\label{sec-1}
Definition of square root:
\sqrt(x) = \mbox{the } y \mbox{ such that } y >= 0 \mbox{ and } y$^{\text{2}}$ = x

This definition is a valid mathematical function which describes the relationship between a number and its root. It is \emph{not} a valid process by which a square root may be derived. A function is declarative knowledge (the properties of a thing), and a procedure is \emph{imperative} knowledge (how to do a thing).

\subsection{Heron of Alexandria's Square Root Algorithm}
\label{sec-1-1}
To find sqrt(x) approximately:
\begin{enumerate}
\item Make a guess G
\item Improve guess by averaging G and X
\item Keep improving G until it is good enough
\item Use 1 as an initial guess
\end{enumerate}

\begin{center}
\begin{tabular}{rll}
Guess & Quotient & Avg.\\
\hline
1 & 2/1 = 2 & ((2+1)/2) = 1.5\\
1.5 & 2/1.5 = 1.3333 & ((1.3333+1.5)/2) = 1.4167\\
1.4167 & 2/1.4167 = 1.4118 & ((1.4167+1.4118)/2) = 1.4142\\
1.4142 & \ldots{} & \ldots{}\\
\end{tabular}
\end{center}

\subsubsection{Naive Version}
\label{sec-1-1-1}
\begin{verbatim}
(defn abs [n]
  (if (< n 0)
    (- n)
    n))

(defn square [n]
  (* n n))

(defn average [x y]
  (/ (+ x y) 2))

(defn improve [guess x]
  (average guess (/ x guess)))

(defn good-enough? [guess x]
  (< (abs (- (square guess) x)) 0.001))

(defn sqrt-iter [guess x]
  (if (good-enough? guess x)
    guess
    (sqrt-iter (improve guess x) x)))

(defn sqrt [x]
  (sqrt-iter 1 x))

(sqrt 2.0)
;; => 1.4142156862745097
\end{verbatim}

\subsubsection{Blocked Version}
\label{sec-1-1-2}
Keeping helper functions \texttt{good-enough?} and others from polluting namespace. This idea originated with Algol 60.

\begin{verbatim}
(defn sqrt2 [x]
  (defn good-enough? [guess x]
    (< (abs (- (square guess) x)) 0.001))
  (defn improve [guess x]
    (/ (+ guess (/ x guess)) 2))
  (defn sqrt-iter [guess x]
    (if (good-enough? guess x)
      guess
      (sqrt-iter (improve guess x) x)))
  (sqrt-iter 1.0 x))

(sqrt2 2)
;; => 1.4142156862745097
\end{verbatim}

\subsubsection{Exercise 1.6}
\label{sec-1-1-3}
Define \texttt{if} in terms of \texttt{cond}:

\begin{verbatim}
(defn new-if [predicate then-clause else-clause]
  (cond
    predicate then-clause
    :else else-clause))

(new-if (= 2 3) 0 5)
;; => 5
\end{verbatim}

Use \texttt{new-if} to write \texttt{square-root}:
\begin{verbatim}
(defn new-sqrt-iter [guess x]
  (new-if (good-enough? guess x)
          guess
          (new-sqrt-iter (improve guess x)
                         x)))
\end{verbatim}

What happens when we eval this?
\begin{verbatim}
(new-sqrt-iter 1 2)

(new-if (good-enough? 1 2)
        1
        (new-sqrt-iter (improve 1 2) 2))

(new-if false
        1
        (new-sqrt-iter (improve 1 2) 2))

(new-sqrt-iter (improve 1 2) 2)
\end{verbatim}

\ldots{}and so on, ad infinitum. This will result in infinite recursion, due to applicative-order evaluation. Because both the \texttt{then-clause} and \texttt{else-clause} operands are evaluated before being applied to the \texttt{cond} operator. Even when the predicate is true, the \texttt{else-clause} is evaluated, keeping the procedure from ever resolving.

\subsubsection{Exercise 1.7}
\label{sec-1-1-4}
\texttt{good-enough?} will be inaccurate for very small numbers. It is also inadequate for very large numbers. Why?

\begin{verbatim}
(sqrt 0.0001)
;; => 0.03230844833048122
;; Should be 0.01
\end{verbatim}

\begin{verbatim}
(defn really-good-enough? [guess oldguess]
  "Stop if change after iteration is less than 0.01%"
  (<= (abs (- guess oldguess))
      (abs (* guess 0.0001))))

(defn sqrt3-iter [guess oldguess x]
  (if (really-good-enough? guess oldguess)
    guess
    (sqrt3-iter (improve guess x) guess x)))

(defn sqrt3 [x]
  (sqrt3-iter 1.0 2 x))

(sqrt3 0.0001)
;; => 0.010000000025490743
\end{verbatim}

\subsubsection{Exercise 1.8}
\label{sec-1-1-5}
Newton's method for cube roots is based on the fact that if y is an approximation to the cube root of x, then a better approximation is given by the value:

$\frac{x/y^2 + 2y}{3}$

\begin{verbatim}
(defn cbrt-good-enough? [guess oldguess]
  "Stop if change after iteration is less than 0.01%"
  (<= (abs (- guess oldguess))
      (abs (* guess 0.0001))))

(defn cbrt-improve [guess x]
  (/ (+ (/ x (* guess guess)) guess guess)
     3))

(defn cbrt-iter [guess oldguess x]
  (if (cbrt-good-enough? guess oldguess)
    guess
    (cbrt-iter (cbrt-improve guess x) guess x)))

(defn cbrt [x]
  (cbrt-iter 1.0 0 x))

(cbrt 42)
;; => 3.476026657071078
\end{verbatim}

\subsection{Procedures as Black-Box Abstractions}
\label{sec-1-2}
Defining procedures is a way to suppress detail. By forming black boxes around procedures which behave in expected ways, we no longer have to consider the details of the inner mechanism.

Parameters passed to black-box procedures are local to that procedure.

\subsubsection{Lexical Scoping}
\label{sec-1-2-1}
We can have a \texttt{naive sqrt procedure}, leaves all its helper processes lying about. A smarter \texttt{blocked version} will put the helper procedures within the top level sqrt procedure. However, because they all share a lexical scope, and the variable x is unchanging within this scope, it is unnecessary to explicitly pass x to each procedure.

\begin{verbatim}
(defn lexical-sqrt [x]
  (defn good-enough? [guess]
          (< (abs (- (square guess) x)) 0.001))
  (defn improve [guess]
    (/ (+ guess (/ x guess)) 2))
  (defn iter [guess]
    (if (good-enough? guess)
      guess
      (iter (improve guess))))
  (iter 1.0))

(lexical-sqrt 2)
;; => 1.4142156862745097
\end{verbatim}

\section{Procedures and the Processes They Generate}
\label{sec-2}
\subsection{Substitution Rule}
\label{sec-2-1}
To evaluate an application:

\begin{enumerate}
\item Evaluate the operator to get procedure
\item Evaluate the operands to get arguments
\item Apply the procedure to the arguments
\begin{enumerate}
\item Copy the body of the procedure, substituting the arguments supplied for the formal parameters of the procedure
\item Evaluate the resulting new body
\end{enumerate}
\end{enumerate}

\subsection{Linear Recursion and Iteration}
\label{sec-2-2}
\begin{verbatim}
(defn recursive-factorial [n]
  (if (= n 1)
    1
    (* n (recursive-factorial (dec n)))))

(factorial 5)
(* 5 (factorial 4))
(* 5 (* 4 (factorial 3)))
(* 5 (* 4 (3 (factorial 2))))
(* 5 (* 4 (* 3 (* 2 (factorial 1)))))
(* 5 (* 4 (* 3 (* 2 (* 1 1)))))
(* 5 (* 4 (* 3 (* 2 1))))
(* 5 (* 4 (* 3 2)))
(* 5 (* 4 6))
(* 5 24)
;; => 120

(defn fact-iter [product count max-count]
  (if (> count max-count)
    product
    (fact-iter (* count product)
               (inc count)
               max-count)))

(defn iterative-factorial [n]
  (fact-iter 1 1 n))

(iterative-factorial 5)
(fact-iter 1 1 5)
(fact-iter 1 2 5)
(fact-iter 2 3 5)
(fact-iter 6 4 5)
(fact-iter 24 5 5)
(fact-iter 120 6 5)
;; => 120
\end{verbatim}

An iteration has all of its state in explicit variables. If the program is killed and restarted, it can continue. Recursion keeps some information "under the table", outside of explicit variables given to the program. 

\begin{verbatim}
(defn fib [n]
  (if (< n 2)
    n
    (+ (fib (- n 1))
       (fib (- n 2)))))
\end{verbatim}
