sicp_notes.org
*** Recursive Process vs. Procedure
A recursive procedure is one whose definition refers (directory or indirectly) to itself. A linearly recursive process, on the other hand, is recursive in the way its evaluation evolves not how it is written. =fact-iter= is a recursive /procedure/ which generates an iterative /process/. Its state is described completely by its three variables, and the interpreter need only keep track of them to execute the process.

In many languages (Ada, Pascal, C...), recursive procedures take memory growing with the number of procedure calls, even when the /process/ is iterative. In these languages, iterative processes can only be defined with special-purpose "looping constructs": =do=, =repeat=, =until=, =for=, etc. Scheme can execute an iterative process (described by a recursive procedure) in constant space. This is called /tail-recursion/.

*** Exercise 1.9
Both processes below define a method for adding two positive integers. Using the substitution model, illustrate the process generated by each procedure in evaluating =(+ 4 5)=. Are these processes iterative or recursive?

#+BEGIN_SRC scheme
  (define (+ a b)
    (if (= a 0)
        b
        (inc (+ (dec a) b))))

  (+ 4 5)
  (inc (+ (dec 4) 5))
  (inc (+ 3 5))
  (inc (inc (+ 2 5)))
  (inc (inc (inc (+ 1 5))))
  (inc (inc (inc (inc (+ 0 5)))))
  (inc (inc (inc (inc 5))))
  (inc (inc (inc 6)))
  (inc (inc 7))
  (inc 8)
  ;; => 9

  (define (+ a b)
    (if (= a 0)
        b
        (+ (dec a) (inc b))))

  (+ 4 5)
  (+ (dec 4) (inc 5))
  (+ 3 6)
  (+ 2 7)
  (+ 1 8)
  (+ 0 9)
  ;; => 9
#+END_SRC

The first is a recursive process, the second iterative. They are both recursively defined procedures.

*** Exercise 1.10
#+BEGIN_SRC clojure
  (defn ack [x y]
    (cond
      (= y 0) 0
      (= x 0) (* 2 y)
      (= y 1) 2
      :else (ack (dec x)
                 (ack x (dec y)))))

  (ack 1 10)
  (ack 0 (ack 1 9))
  (ack 0 (ack 0 (ack 1 8)))
  (ack 0 (ack 0 (ack 0 (ack 1 7))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 1 6)))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 1 5))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 1 4)))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 1 3))))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 1 2)))))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 1 1))))))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 2)))))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 4))))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 8)))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 16))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 32)))))
  (ack 0 (ack 0 (ack 0 (ack 0 64))))
  (ack 0 (ack 0 (ack 0 128)))
  (ack 0 (ack 0 256))
  (ack 0 512)
  ;; => 1024

  (ack 2 4)
  (ack 1 (ack 2 3))
  (ack 1 (ack 1 (ack 2 2)))
  (ack 1 (ack 1 (ack 1 (ack 2 1))))
  (ack 1 (ack 1 (ack 1 2)))
  (ack 1 (ack 1 (ack 0 (ack 1 1))))
  (ack 1 (ack 1 (ack 0 2)))
  (ack 1 (ack 1 4))
  (ack 1 (ack 0 (ack 1 3)))
  (ack 1 (ack 0 (ack 0 (ack 1 2))))
  (ack 1 (ack 0 (ack 0 (ack 0 (ack 1 1)))))
  (ack 1 (ack 0 (ack 0 (ack 0 2))))
  (ack 1 (ack 0 (ack 0 4)))
  (ack 1 (ack 0 8))
  (ack 1 16)
  (ack 0 (ack 1 15))
  (ack 0 (ack 0 (ack 1 14)))
  (ack 0 (ack 0 (ack 0 (ack 1 13))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 1 12)))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 1 11))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 1 10)))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 1024))))))
  (ack 0 (ack 0 (ack 0 (ack 0 (ack 0 2048)))))
  (ack 0 (ack 0 (ack 0 (ack 0 4096))))
  (ack 0 (ack 0 (ack 0 8192)))
  (ack 0 (ack 0 16384))
  (ack 0 32768)
  ;; => 65536

  (ack 3 3)
  (ack 2 (ack 3 2))
  (ack 2 (ack 2 (ack 3 1)))
  (ack 2 (ack 2 2))
  (ack 2 (ack 1 (ack 2 1)))
  (ack 2 (ack 1 2))
  (ack 2 (ack 0 (ack 1 1)))
  (ack 2 (ack 0 2))
  (ack 2 4)
  ;; => 65536

  (defn f [n]
    (ack 0 n))
  (f 100)
  ;; => 200

  ;; f(x) = 2x

  (defn g [n]
    (ack 1 n))
  (= (g 50)
     (apply * (repeat 50 2N)))
  ;; => true

  ;; g(x) = 2^x

  (defn h [n]
    (ack 2 n))

  ;; h(n) = 2^2^... (n times)
#+END_SRC

** Tree Recursion
#+BEGIN_SRC clojure
  (defn fib [n]
    (cond
      (= n 0) 0
      (= n 1) 1
      :else (+ (fib (dec n))
               (fib (dec (dec n))))))
#+END_SRC

Because =fib= calls itself twice each time it is invoked, the process ends up looking like a tree. The number of steps required in such a process is proportional to the number of nodes in the tree, and the space required is proportional to the maximum depth.

#+BEGIN_SRC clojure
  (defn fib-iter [a b count]
    (if (= count 0)
      b
      (fib-iter (+ a b) a (dec count))))

  (defn fib [n]
    (fib-iter 1 0 n))

  (map fib (range 1 11))
  ;; => (1 1 2 3 5 8 13 21 34 55)
#+END_SRC

*** Counting change
How many different ways can we make change of $1.00, given half-dollars, quarters, dimes, nickels, and pennies? More generally, can we write a procedure to compute the number of ways to change any given amount of money?

The number of ways to change amount /a/ using /n/ kinds of coins equals

- The number of ways to change amount /a/ using all but the first kind of coin, plus
- The number of ways to change amount /a - d/ using all /n/ kinds of coins, where /d/ is the denomination of the first kind of coin.

Keeping in mind that

- If a is exactly 0, we should count that as 1 way to make change.
- If a is less than 0, we should count that as 0 ways to make change.
- If n is 0, we should count that as 0 ways to make change.

#+BEGIN_SRC clojure
  (defn first-denomination [kinds-of-coins]
    (cond
      (= kinds-of-coins 1) 1
      (= kinds-of-coins 2) 5
      (= kinds-of-coins 3) 10
      (= kinds-of-coins 4) 25
      (= kinds-of-coins 5) 50))

  (defn cc [amount kinds-of-coins]
    (cond
      (= amount 0) 1
      (or (< amount 0) (= kinds-of-coins 0)) 0
      :else (+ (cc amount (dec kinds-of-coins))
               (cc (- amount
                      (first-denomination kinds-of-coins))
                   kinds-of-coins))))

  (defn count-change [amount]
    (cc amount 5))

  (count-change 11)
  (cc 11 5)
  (cond (= 11 0) 1 (or (< 11 0) (= 5 0)) 0 :else (+ (cc 11 4) (cc (- 11 50) 5)))
  (+ (cc 11 4) (cc -39 5))
  (+ (+ (cc 11 3) (cc (- 11 25) 4)) 0)
  (+ (cc 11 3) 0)
  ;; => 4
#+END_SRC

*** Exercise 1.11
A function f is defined by the rule that f(n) = n if n<3 and f(n) = f(n - 1) + 2f(n - 2) + 3f(n - 3) if n> 3. Write a procedure that computes f by means of a recursive process. Write a procedure that computes f by means of an iterative process.

#+BEGIN_SRC clojure
  (defn f
    "Version with recursive process"
    [n]
    (if (< n 3)
      n
      (+ (f (dec n))
         (* 2 (f (- n 2)))
         (* 3 (f (- n 3))))))

  (map #(vector % (f %)) (range 1 10))
  ;; =>
  ;; ([1 1]
  ;;  [2 2]
  ;;  [3 4]
  ;;  [4 11]
  ;;  [5 25]
  ;;  [6 59]
  ;;  [7 142]
  ;;  [8 335]
  ;;  [9 796])

  (f 3)
  (+ (f 2)
     (* 2 (f 1))
     (* 3 (f 0)))
  ;; => 4

  (f 4)
  (+ (+ (f 2)
        (* 2 (f 1))
        (* 3 (f 0)))
     (* 2 (f 2))
     (* 3 (f 1)))
  ;; => 11

  (defn f-iter [a b c count]
    (cond
      (< count 3) count
      (= count 3) (+ c (* 2 b) (* 3 a))
      :else (f-iter b c (+ c (* 2 b) (* 3 a)) (dec count))))

  (defn iterative-f [n]
    (f-iter 0 1 2 n))

  ;; Two functions give the same results
  (for [n (range 1 10)]
    (= (iterative-f n) (f n)))
  ;; =>
  ;; (true
  ;;  true
  ;;  true
  ;;  true
  ;;  true
  ;;  true
  ;;  true
  ;;  true
  ;;  true)
#+END_SRC

