sicp_notes.org
*** Exercise 1.12
Write a procedure that computes elements of Pascal's triangle by means of a recursive process.

#+BEGIN_SRC clojure
  (defn pascal-layer
    "Take a non-negative number n and returns the nth slice of Pascal's triangle"
    [n]
    (let [gen-next (fn [prev]
                     (map (partial apply +) (partition 2 1 prev)))]
      (cond
        (= 0 n) '(1)
        (= 1 n) '(1 1)
        :else (concat [1] (gen-next (pascal-layer (dec n))) [1]))))

  (map pascal-layer (range 9))
  ;; =>
  ;; ((1)
  ;;  (1 1)
  ;;  (1 2 1)
  ;;  (1 3 3 1)
  ;;  (1 4 6 4 1)
  ;;  (1 5 10 10 5 1)
  ;;  (1 6 15 20 15 6 1)
  ;;  (1 7 21 35 35 21 7 1)
  ;;  (1 8 28 56 70 56 28 8 1))

  (defn nextrow [row]
    (vec (concat [1] (map #(apply + %) (partition 2 1 row)) [1] )))

  (def pascal
    (iterate #(concat [1]
                      (map + % (rest %))
                      [1])
             [1]))
#+END_SRC

*** Tower of Hanoi
#+BEGIN_SRC clojure
  (defn move [n from to spare]
    (cond (= 0 n) "done"
          :else (do (move (dec n) from spare to)
                    (move (dec n) spare to from))))
#+END_SRC

** Exponentiation
Linearly recursive definition, requires O(n) steps and O(n) space.

#+BEGIN_SRC clojure
  (defn expt [b n]
    (if (= n 0)
      1
      (* b (expt b (dec n)))))

  (expt 2 5)
  (* 2 (expt 2 4))
  (* 2 (* 2 (expt 2 3)))
  (* 2 (* 2 (* 2 (expt 2 2))))
  (* 2 (* 2 (* 2 (* 2 (expt 2 1)))))
  (* 2 (* 2 (* 2 (* 2 (* 2 (expt 2 0))))))
  (* 2 (* 2 (* 2 (* 2 (* 2 1)))))
  (* 2 (* 2 (* 2 (* 2 2))))
  (* 2 (* 2 (* 2 4)))
  (* 2 (* 2 8))
  (* 2 16)
  ;; => 32
#+END_SRC

#+RESULTS:
: #'user/expt3232323232323232323232

Faster version, taking advantage of the fact that b^n = (b^(n/2))^2 if n is even, and b^n = b * b^(n-1) if odd. This grows in O(log(n)) time. 

#+BEGIN_SRC clojure
  (defn square [n]
    (* n n))

  (defn fast-expt [b n]
    (cond (= n 0) 1
          (even? n) (square (fast-expt b (/ n 2)))
          :else (* b (fast-expt b (dec n)))))

  (fast-expt 2 6)
  (square (fast-expt 2 3))
  (square (* 2 (fast-expt 2 2)))
  (square (* 2 (square (fast-expt 2 1))))
  (square (* 2 (square (* 2 (fast-expt 2 0)))))
  (square (* 2 (square (* 2 1))))
  (square (* 2 (square 2)))
  (square (* 2 4))
  (square 8)
  ;; => 64
#+END_SRC

#+RESULTS:
: #'user/square#'user/fast-expt646464646464646464

O(log(n)) and O(n) are hugely different as n grows large.

#+BEGIN_SRC clojure
  (time (expt 2N 100))

  (time (fast-expt 2N 50))
#+END_SRC

*** Exercise 1.16
Design a procedure that evolves an iterative exponentiation process that uses successive squaring and uses a logarithmic number of steps, as does fast-expt. (Hint: Using the observation that (bn/2)2 = (b2)n/2, keep, along with the exponent n and the base b, an additional state variable a, and define the state transformation in such a way that the product a bn is unchanged from state to state. At the beginning of the process a is taken to be 1, and the answer is given by the value of a at the end of the process. In general, the technique of defining an invariant quantity that remains unchanged from state to state is a powerful way to think about the design of iterative algorithms.)

#+BEGIN_SRC clojure
  (defn iterative-expt [b n]
    (let [iter (fn [a b n]
                 (cond
                   (= 0 n) a
                   (even? n) (iter a (square b) (/ n 2))
                   :else (iter (* a b) b (dec n))))])
    (iter 1 b n))

  (iterative-fast-expt 2 10)

  ;; => 1024
#+END_SRC

*** Exercise 1.17
The exponentiation algorithms in this section are based on performing exponentiation by means of repeated multiplication. In a similar way, one can perform integer multiplication by means of repeated addition. The following multiplication procedure (in which it is assumed that our language can only add, not multiply) is analogous to the expt procedure:

#+BEGIN_SRC scheme
  (define (* a b)
    (if (= b 0)
        0
        (+ a (* a (- b 1)))))
#+END_SRC

This algorithm takes a number of steps that is linear in b. Now suppose we include, together with addition, operations double, which doubles an integer, and halve, which divides an (even) integer by 2. Using these, design a multiplication procedure analogous to fast-expt that uses a logarithmic number of steps.

#+BEGIN_SRC clojure
  (defn double [n]
    (* n 2))

  (defn halve [n]
    (/ n 2))

  (defn multiply [a b]
    (cond
      (= 0 b) 0
      (even? b) (multiply (double a) (halve b))
      :else (+ a (multiply a (dec b)))))

  (multiply 7 100)
  ;; => 700
#+END_SRC

*** Exercise 1.18
Using the results of exercises 1.16 and 1.17, devise a procedure that generates an iterative process for multiplying two integers in terms of adding, doubling, and halving and uses a logarithmic number of steps.

#+BEGIN_SRC clojure
  (defn *-iter [acc a b]
    (cond
      (= b 0) acc
      (even? b) (*-iter acc (double a) (halve b))
      :else (*-iter (+ acc a) a (dec b))))

  (defn iterative-* [a b]
    (*-iter 0 a b))

  (iterative-* 8 9)
  ;; => 72
#+END_SRC

*** Exercise 1.19
#+BEGIN_SRC clojure
  (defn fib-iter [a b p q count]
    (cond
      (= count 0) b
      (even? count) (fib-iter a
                              b
                              (+ (* p p) (* q q))
                              (+ (* 2 p q) (* q q))
                              (/ count 2))
      :else (fib-iter (+ (* b q) (* a q) (* a p))
                      (+ (* b p) (* a q))
                      p
                      q
                      (dec count))))
  (defn fib [n]
    (fib-iter 1 0 0 1 n))

  (map fib (range 1 11))
  ;; =>
  ;; (1 1 2 3 5 8 13 21 34 55)
#+END_SRC

** Greatest Common Denominators
The idea of the algorithm is based on the observation that, if r is the remainder when a is divided by b, then the common divisors of a and b are precisely the same as the common divisors of b and r. Thus, we can use the equation

GCD(a,b) = GCD(b,r)

To successively reduce the problem of computing a GCD to the problem of computing the GCD of smaller and smaller pairs of integers. For example,

GCD(206,40) = GCD(40,6)
            = GCD(6,4)
            = GCD(4,2)
            = GCD(2,0)
            = 2

#+BEGIN_SRC clojure
  (defn gcd
    "An iterative process in log(n) time"
    [a b]
    (if (= b 0)
      a
      (gcd b (rem a b))))

  (gcd 206 40)
  ;; => 2
#+END_SRC

This is known as /Euclid's Algorithm/.

*** Lamé's Theorem
If Euclid's Algorithm requires k steps to compute the GCD of some pair, then the smaller number in the pair must be greater than or equal to the kth Fibonacci number.

** Testing for Primality

*** Searching for divisors
The following program finds the smallest integral divisor (greater than 1) of a given number n. It does this in a straightforward way, by testing n for divisibility by successive integers starting with 2.

#+BEGIN_SRC clojure
  (defn divides? [a b]
    (= (rem b a) 0))

  (defn find-divisor [n test-divisor]
    (cond
      (> (square test-divisor) n) n
      (divides? test-divisor n) test-divisor
      :else (find-divisor n (inc test-divisor))))

  (defn smallest-divisor [n]
    (find-divisor n 2))

  (smallest-divisor 25)
  ;; => 5

  (defn prime? [n]
    (= n (smallest-divisor n)))

  (prime? 25)
  ;; => false

  (prime? 11)
  ;; => true
#+END_SRC

The algorithm tests divisors between 1 and sqrt(n). Therefore, the number of steps required to identify n as prime will have an order of growth O(sqrt(n))

