sicp_notes.tex

\subsubsection{The Fermat test}
\label{sec-2-6-2}
\textbf{Fermat's Little Theorem:} If n is a prime number and a is any positive integer less than n, then a raised to the nth power is congruent to a modulo n.

(Two numbers are said to be congruent modulo n if they both have the same remainder when divided by n. The remainder of a number a when divided by n is also referred to as the remainder of a modulo n, or simply as a modulo n.)

\begin{verbatim}
(defn expmod [base exp m]
  (cond
    (= exp 0) 1
    (even? exp) (rem (square (expmod base (/ exp 2) m))
                     m)
    :else (rem (* base (expmod base (dec exp) m))
               m)))

(defn fermat-test [n]
  (defn try-it [a]
    (= (expmod a n n) a))
  (try-it (+ 1 (rand-int (dec n)))))

(defn fast-prime? [n times]
  (cond
    (= times 0) true
    (fermat-test n) (fast-prime? n (dec times))
    :else false))

(fast-prime? 31939 100)
;; => true
\end{verbatim}
\section{Higher Order Procedures}
\label{sec-3}
\begin{verbatim}
(defn sum-int
  "Sums integers from a to b"
  [a b]
  (if (> a b)
    0
    (+ a (sum-int (inc a) b))))

(sum-int 1 10)
;; => 55

(defn sum-of-squares
  "Sums the squares of the integers from a to b"
  [a b]
  (if (> a b)
    0
    (+ (square a) (sum-of-squares (inc a) b))))

(sum-of-squares 1 10)
;; => 385

(defn sigma
  "Procedure for generating summation procedures. Term denotes the lower bound
  index, and next gives the next index."
  [term a next b]
  (if (> a b)
    0
    (+ (term a)
       (sigma term (next a) next b))))

(defn sum-int-2 [a b]
  (sigma identity a inc b))

(sum-int-2 1 10)
;; => 55

(defn sum-of-squares-2 [a b]
  (sigma square a inc b))

(sum-of-squares-2 1 10)
;; => 385

(defn pi-sum-2 [a b]
  (sigma (fn [i] (/ 1 (* i (+ i 2))))
         a
         (fn [i] (+ i 4))
         b))
(pi-sum-2 1.0 100)
;; => 0.3901993315738763
\end{verbatim}
\subsection{Improving Heron of Alexandria's Square Root Algorithm}
\label{sec-3-1}
\texttt{This} algorithm for computing square roots is effective but difficult to parse. What it is essentially trying to do is find the fixed point of some function which gives the square root.

\begin{verbatim}
(defn fixed-point
  "Returns the fixed point of the function f starting with start, iterating the
  function until the results converge within a given tolerance."
  [f start]
  (let [tolerance 0.00001
        close-enough? (fn [u v] (< (abs (- u v)) tolerance))]
    (loop [old start
           new (f start)]
      (if (close-enough? old new)
        new
        (recur new (f new))))))

  (defn sqrt
    "The square root of x is the fixed point of that procedure which takes y and
    averages x/y with y."
    [x]
    (fixed-point (fn [y] (average (/ x y) y))
                 1))

  (sqrt 2.0)
  ;; => 1.4142135623746899
\end{verbatim}

But why the need to find the fixed point of f(y) = (y + x/y)/2 ? This is counter intuitive. More directly obvious is that the fixed point of f(y) = x/y will give a value y which is the square root of x. But procedure can't be used directly. If 1 is given as a starting value y and x is 2, x/y is 2. 2/2 is 1. This is an oscillation, which will never converge. The way you get an oscillation to converge is by averaging it. Expressing this abstraction:

\begin{verbatim}
(defn avg-damp
  "Averages the last value with the value returned by running f on it."
  [f]
  (fn [x] (average (f x) x)))

(defn sqrt
  "Square root of x is the fixed point of the procedure resulting from
  average-damp."
  [x]
  (fixed-point (avg-damp (fn [y] (/ x y)))
               1))

(sqrt 2.0)
;; => 1.4142135623746899
\end{verbatim}

\subsection{Newton's Method}
\label{sec-3-2}
A method for finding the roots of a function.

To find a y such that f(y) = 0:
Start with a guess, y$_{\text{0}}$;
y$_{\text{n}}$+1 = y$_{\text{n}}$ - f(y$_{\text{n}}$)/(df/dy|y = y$_{\text{n}}$)

\begin{verbatim}
(def dx 0.000001)

(defn deriv [f]
  (fn [x] (/ (- (f (+ x dx))
                (f x))
             dx)))

(defn newton [f guess]
  (let [df (deriv f)]
    (fixed-point (fn [x] (- x (/ (f x) (df x))))
                 guess)))

(defn sqrt
  "The value of y for which (- x (* y y)) => 0 is the square root of x."
  [x]
  (newton (fn [y] (- x (* y y)))
          1))

(sqrt 2.0)
;; => 1.4142135623754424
\end{verbatim}

\subsection{Rights and Privileges of First-class Citizens (in a programming language)}
\label{sec-3-3}
\begin{enumerate}
\item To be named by variables
\item To be passed as arguments to procedures
\item To be returned as values of procedures
\item To be incorporated into data structures
\end{enumerate}

\section{Compound Data}
\label{sec-4}
In writing square root, we contract out some work to good-enough?. We don't care exactly what it does, as long as it takes and returns the right values. We divorce the task of building things from the task of implementing the parts. Isolating details!

\subsection{Rational Numbers}
\label{sec-4-1}
By wishful thinking.

\begin{verbatim}
(defn make-rat
  "Take a numerator and denominator and returns a 'cloud' which represents a
  rational number"
  [n d]
  {:numer n :denom d})

;; (make-rat n d) => cloud
;; (:numer cloud) => n
;; (:denom cloud) => d

(defn +rat [x y]
  (make-rat
   (+ (* (:numer x) (:denom y))
      (* (:numer y) (:denom x)))
   (* (:denom x) (:denom y))))

(defn *rat [x y]
  (make-rat
   (* (:numer x) (:numer y))
   (* (:denom x) (:denom y))))
\end{verbatim}
% Emacs 24.5.50.1 (Org mode 8.2.10)
\end{document}
